balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16C717.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11110000" edc:name="IOCB" edc:nzwidth="0x8" edc:por="11110000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCB0" edc:desc="" edc:mask="0x1" edc:name="IOCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCB1" edc:desc="" edc:mask="0x1" edc:name="IOCB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCB2" edc:desc="" edc:mask="0x1" edc:name="IOCB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCB3" edc:desc="" edc:mask="0x1" edc:name="IOCB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCB4" edc:desc="" edc:mask="0x1" edc:name="IOCB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCB5" edc:desc="" edc:mask="0x1" edc:name="IOCB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCB6" edc:desc="" edc:mask="0x1" edc:name="IOCB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCB7" edc:desc="" edc:mask="0x1" edc:name="IOCB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="P1DEL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="P1DEL" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P1DEL" edc:desc="" edc:mask="0xff" edc:name="P1DEL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3"/>
        <edc:SFRDef edc:access="nnnn----" edc:cname="REFCON" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="REFCON" edc:nzwidth="0x8" edc:por="0000----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="VRLOEN" edc:desc="" edc:mask="0x1" edc:name="VRLOEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRHOEN" edc:desc="" edc:mask="0x1" edc:name="VRHOEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRLEN" edc:desc="" edc:mask="0x1" edc:name="VRLEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRHEN" edc:desc="" edc:mask="0x1" edc:name="VRHEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--rnnnnn" edc:cname="LVDCON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000101" edc:name="LVDCON" edc:nzwidth="0x8" edc:por="--000101">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LV" edc:desc="" edc:mask="0xf" edc:name="LV" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="LVDEN" edc:desc="" edc:mask="0x1" edc:name="LVDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BGST" edc:desc="" edc:mask="0x1" edc:name="BGST" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LV0" edc:desc="" edc:mask="0x1" edc:name="LV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LV1" edc:desc="" edc:mask="0x1" edc:name="LV1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LV2" edc:desc="" edc:mask="0x1" edc:name="LV2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LV3" edc:desc="" edc:mask="0x1" edc:name="LV3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ANSEL" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="ANSEL" edc:nzwidth="0x8" edc:por="--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANS0" edc:desc="" edc:mask="0x1" edc:name="ANS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANS1" edc:desc="" edc:mask="0x1" edc:name="ANS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANS2" edc:desc="" edc:mask="0x1" edc:name="ANS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANS3" edc:desc="" edc:mask="0x1" edc:name="ANS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANS4" edc:desc="" edc:mask="0x1" edc:name="ANS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANS5" edc:desc="" edc:mask="0x1" edc:name="ANS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADRESL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="ADRESL" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADRESL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="ADRESL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="ADCON1" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="ADCON1" edc:nzwidth="0x8" edc:por="0000----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="VCFG" edc:desc="" edc:mask="0x7" edc:name="VCFG" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ADFM" edc:desc="" edc:mask="0x1" edc:name="ADFM" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="VCFG0" edc:desc="" edc:mask="0x1" edc:name="VCFG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VCFG1" edc:desc="" edc:mask="0x1" edc:name="VCFG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VCFG2" edc:desc="" edc:mask="0x1" edc:name="VCFG2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="2" edc:beginaddr="0x100" edc:endaddr="0x110" edc:regionid="sfr2">
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr0"/>
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr0"/>
        <edc:Mirror edc:nzsize="0x3" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="3"/>
        <edc:Mirror edc:nzsize="0x2" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="PMDATL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PMDATL" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMDATL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="PMDATL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PMADRL" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMADRL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="PMADRL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--rrrrrr" edc:cname="PMDATH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PMDATH" edc:nzwidth="0x8" edc:por="--xxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMDATH" edc:desc="" edc:islanghidden="true" edc:mask="0x3f" edc:name="PMDATH" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PMADRH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="PMADRH" edc:nzwidth="0x8" edc:por="----xxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMADRH" edc:desc="" edc:islanghidden="true" edc:mask="0xf" edc:name="PMADRH" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x190" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr0"/>
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr1"/>
        <edc:Mirror edc:nzsize="0x3" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr1"/>
        <edc:AdjustPoint edc:offset="3"/>
        <edc:Mirror edc:nzsize="0x2" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="r------s" edc:cname="PMCON1" edc:desc="" edc:impl="0x81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1------0" edc:name="PMCON1" edc:nzwidth="0x8" edc:por="1------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="" edc:mask="0x1" edc:name="RD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x20" edc:endaddr="0x70" edc:regionid="gpr0"/>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x70" edc:endaddr="0x80" edc:regionid="gprnobnk"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xa0" edc:endaddr="0xf0" edc:regionid="gpr1"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xf0" edc:endaddr="0x100" edc:regionid="gpr1s" edc:shadowidref="gprnobnk"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x120" edc:endaddr="0x170" edc:regionid="gpr2"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x170" edc:endaddr="0x180" edc:regionid="gpr2s" edc:shadowidref="gprnobnk"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x1f0" edc:endaddr="0x200" edc:regionid="gpr3" edc:shadowidref="gprnobnk"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="AN0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="LVDIN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="T0CKI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="MCLR"/>
      <edc:VirtualPin edc:name="Vpp"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="Vref-"/>
      <edc:VirtualPin edc:name="VRL"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="Vref+"/>
      <edc:VirtualPin edc:name="VRH"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="INT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="SS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="SDI"/>
      <edc:VirtualPin edc:name="SDA"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="SDO"/>
      <edc:VirtualPin edc:name="P1B"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="T1OSO"/>
      <edc:VirtualPin edc:name="T1CKI"/>
      <edc:VirtualPin edc:name="P1C"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="T1OSI"/>
      <edc:VirtualPin edc:name="P1D"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="RA6"/>
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKOUT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKIN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="SCK"/>
      <edc:VirtualPin edc:name="SCL"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="CCP1"/>
      <edc:VirtualPin edc:name="P1A"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
